In [0]:
import numpy as np
import pandas as pd

# Reshaping Data

It is often desirable to reshape a dataset into a more concise format. An example of this would be Excel pivot tables.

Pandas provides useful functions to reshape data. To explore these functions, we will load both the Titanic dataset and the Air Quality dataset.

In [0]:
# Open the titanic CSV
titanic = pd.read_csv("https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv")

titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [0]:
# Open the air quality CSV
air_quality  = pd.read_csv("https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/air_quality_long.csv", index_col="date.utc", parse_dates=True)

air_quality .head()

                                city country location parameter  value   unit
date.utc
2019-06-18 06:00:00+00:00  Antwerpen      BE  BETR801      pm25   18.0  µg/m³
2019-06-17 08:00:00+00:00  Antwerpen      BE  BETR801      pm25    6.5  µg/m³
2019-06-17 07:00:00+00:00  Antwerpen      BE  BETR801      pm25   18.5  µg/m³
2019-06-17 06:00:00+00:00  Antwerpen      BE  BETR801      pm25   16.0  µg/m³
2019-06-17 05:00:00+00:00  Antwerpen      BE  BETR801      pm25    7.5  µg/m³

Notice that the air quality data is in a long format, with each observation on a seperate row and each variable in a seperate column.

# Sorting Rows

Row sorting is done with the `sort_values()` function.

First let's sort the titanic data acording to the **Age** of the passengers.

In [0]:
# Sort titanic data by age
titanic.sort_values(by="Age").head()

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
803          804         1       3  ...   8.5167   NaN         C
755          756         1       2  ...  14.5000   NaN         S
644          645         1       3  ...  19.2583   NaN         C
469          470         1       3  ...  19.2583   NaN         C
78            79         1       2  ...  29.0000   NaN         S

[5 rows x 12 columns]

We can sort multiple columns at once by passing a list of column names.

This time we will sort by **Pclass** and **Age**.

In [0]:
titanic.sort_values(by=['Pclass', 'Age']).head()

     PassengerId  Survived  Pclass  ...      Fare    Cabin  Embarked
305          306         1       1  ...  151.5500  C22 C26         S
297          298         0       1  ...  151.5500  C22 C26         S
445          446         1       1  ...   81.8583      A34         S
802          803         1       1  ...  120.0000  B96 B98         S
435          436         1       1  ...  120.0000  B96 B98         S

[5 rows x 12 columns]

Let's do the same sort, but this time in descending order by setting `ascending=False`.

In [0]:
titanic.sort_values(by=['Pclass', 'Age'], ascending=False).head()

     PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
851          852         0       3  ...  7.7750   NaN         S
116          117         0       3  ...  7.7500   NaN         Q
280          281         0       3  ...  7.7500   NaN         Q
483          484         1       3  ...  9.5875   NaN         S
326          327         0       3  ...  6.2375   NaN         S

[5 rows x 12 columns]

# Prepare a Demo Subset

We need a small subset of the data to illustrate reshaping.

In the air quality data, what parameter values do we have?

In [0]:
air_quality["parameter"].unique()

array(['pm25', 'no2'], dtype=object)

We have both PM<sub>25</sub> and NO<sub>2</sub> data.

Let's select only the NO<sub>2</sub> data

In [0]:
# Select no2 data
no2 = air_quality[air_quality["parameter"] == "no2"]

no2.head()

                            city country location parameter  value   unit
date.utc
2019-06-21 00:00:00+00:00  Paris      FR  FR04014       no2   20.0  µg/m³
2019-06-20 23:00:00+00:00  Paris      FR  FR04014       no2   21.8  µg/m³
2019-06-20 22:00:00+00:00  Paris      FR  FR04014       no2   26.5  µg/m³
2019-06-20 21:00:00+00:00  Paris      FR  FR04014       no2   24.9  µg/m³
2019-06-20 20:00:00+00:00  Paris      FR  FR04014       no2   21.4  µg/m³

Now we'll get an even smaller subset of data by

- Sorting by the date (`sort_index`)
- Grouping by location (`groupby`)
- Selecting two measurements for each location (`head`)

In [0]:
no2_subset = no2.sort_index().groupby(["location"]).head(2)
no2_subset

                                city country  ... value   unit
date.utc                                      ...
2019-04-09 01:00:00+00:00  Antwerpen      BE  ...  22.5  µg/m³
2019-04-09 01:00:00+00:00      Paris      FR  ...  24.4  µg/m³
2019-04-09 02:00:00+00:00     London      GB  ...  67.0  µg/m³
2019-04-09 02:00:00+00:00  Antwerpen      BE  ...  53.5  µg/m³
2019-04-09 02:00:00+00:00      Paris      FR  ...  27.4  µg/m³
2019-04-09 03:00:00+00:00     London      GB  ...  67.0  µg/m³

[6 rows x 6 columns]

# Pivot: Reshape long to wide

![Pivot](https://drive.google.com/uc?id=1RATtZcEE5emTa-tuWyt-XvO-7Po7CXjd)

The `pivot()` function reshapes data from long to wide format.

Let's display our **no2_subset** data with the NO<sub>2</sub> values for all three stations next to each other.

In [0]:
no2_subset.pivot(columns="location", values="value")

location                   BETR801  FR04014  London Westminster
date.utc
2019-04-09 01:00:00+00:00     22.5     24.4                 NaN
2019-04-09 02:00:00+00:00     53.5     27.4                67.0
2019-04-09 03:00:00+00:00      NaN      NaN                67.0

Comparing this `pivot` output to the original **no2_subset** Dataframe, we see that it contains the exact same data. The `pivot` has merely reshaped our data.

# Pivot Table: Reshape and Aggregate

The `pivot_table()` function both reshapes data and aggregates values.

We have many measurements over time in our dataset. What if we want to find the mean concentration of both PM<sub>25</sub> and NO<sub>2</sub> in table form?

In [0]:
air_quality.pivot_table(values="value", index="location",
                        columns="parameter", aggfunc="mean")

parameter                 no2       pm25
location
BETR801             26.950920  23.169492
FR04014             29.374284        NaN
London Westminster  29.740050  13.443568

If we also want summary columns, we can set `margins=True`

In [0]:
air_quality.pivot_table(values="value", index="location",
                        columns="parameter", aggfunc="mean",
                        margins=True)

parameter                 no2       pm25        All
location
BETR801             26.950920  23.169492  24.982353
FR04014             29.374284        NaN  29.374284
London Westminster  29.740050  13.443568  21.491708
All                 29.430316  14.386849  24.222743

# Melt: Reshape wide to long

![Melt](https://drive.google.com/uc?id=1sdGEMI90GrhrqfOqjxcOqBT3RJg24WrN)

Let's start with our pivoted results in wide format.

In [0]:
no2_pivoted = no2.pivot(columns="location", values="value")

no2_pivoted.head()

location                   BETR801  FR04014  London Westminster
date.utc
2019-04-09 01:00:00+00:00     22.5     24.4                 NaN
2019-04-09 02:00:00+00:00     53.5     27.4                67.0
2019-04-09 03:00:00+00:00     54.5     34.2                67.0
2019-04-09 04:00:00+00:00     34.5     48.5                41.0
2019-04-09 05:00:00+00:00     46.5     59.5                41.0

We want the data to be treated as a column, so we will reset the index.

In [0]:
no2_pivoted = no2_pivoted.reset_index()

no2_pivoted.head()

location                  date.utc  BETR801  FR04014  London Westminster
0        2019-04-09 01:00:00+00:00     22.5     24.4                 NaN
1        2019-04-09 02:00:00+00:00     53.5     27.4                67.0
2        2019-04-09 03:00:00+00:00     54.5     34.2                67.0
3        2019-04-09 04:00:00+00:00     34.5     48.5                41.0
4        2019-04-09 05:00:00+00:00     46.5     59.5                41.0

We can use `melt()` to reshape this wide format data to long format where each observation has its own row.

In [0]:
no_2 = no2_pivoted.melt(id_vars="date.utc")

no_2.head()

                   date.utc location  value
0 2019-04-09 01:00:00+00:00  BETR801   22.5
1 2019-04-09 02:00:00+00:00  BETR801   53.5
2 2019-04-09 03:00:00+00:00  BETR801   54.5
3 2019-04-09 04:00:00+00:00  BETR801   34.5
4 2019-04-09 05:00:00+00:00  BETR801   46.5

Notice that our column headers have all been "melted" into a single **location** column.

By default, `melt()` combines all columns that are NOT mentioned in `id_vars`. The result is always two columns: A column with the header names, and a column with the table values named **value**.

# Summary

- Sorting by one or more columns can be done with `sort_values`
- `pivot` reshapes data
- `pivot_table` both reshapes and aggregates data
- The reverse of `pivot` (long to wide format) is `melt` (wide to long format)